Issue is not reproducible. Current provider behavior is working as expected. 
Steps tried:
- Start with a fresh env, type env and make sure no TF_VAR variables exist.
- export TF_LOG=TRACE to check logs
- create a password protected keypair
- ensure your oci config does not have any default config or your tf file have any parameter values added.
- export only the necessary TF_VARs
`TF_VAR_tenancy_ocid=ocid1.tenancy.oc1.xxxxxx
TF_VAR_fingerprint=11:12:13:14:15:16:17:18:19:20:21:22:23:24:25:26
TF_VAR_user_ocid=ocid1.user.oc1..xxxxxx
TF_VAR_region=us-phoenix-1
TF_VAR_private_key_password=1234`
- terraform init
- terraform plan - plan succeeded

`2023/05/09 19:23:20 [INFO] backend/local: plan operation completed

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_core_vcn.internal will be created
  + resource "oci_core_vcn" "internal" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = "172.16.0.0/20"
      + cidr_blocks                      = (known after apply)
2023/05/09 19:23:20 [TRACE] statemgr.Filesystem: removing lock metadata file .terraform.tfstate.lock.info
      + compartment_id                   = "ocid1.tenancy.oc1..aaaaaaaawgbzspd6cjovpmic7dahwbalg4opcbixgguo6z2s7t335m6lalbq"
2023/05/09 19:23:20 [TRACE] statemgr.Filesystem: unlocking terraform.tfstate using fcntl flock
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "My internal VCN"
      + dns_label                        = "internal"
      + freeform_tags                    = (known after apply)
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)

      + byoipv6cidr_details {
          + byoipv6range_id = (known after apply)
          + ipv6cidr_block  = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.`

